/*
 * Simple MPEG/DVB parser to achieve network/service information without initial tuning data
 *
 * Copyright (C) 2006, 2007, 2008 Winfried Koehler 
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA
 * Or, point your browser to http://www.gnu.org/licenses/old-licenses/gpl-2.0.html
 *
 * The author can be reached at: handygewinnspiel AT gmx DOT de
 *
 * The project's page is http://wirbel.htpc-forum.de/w_scan/index2.html
 *
 *  referred standards:
 *
 *    ETSI EN 300 468 v1.7.1
 *    ETSI TR 101 211
 *    ETSI ETR 211
 *    ITU-T H.222.0
 *
 ##############################################################################
 * This is tool is derived from the dvb scan tool,
 * Copyright: Johannes Stezenbach <js@convergence.de> and others, GPLv2 and LGPL
 * (linuxtv-dvb-apps-1.1.0/utils/scan)
 *
 * Differencies:
 * - command line options
 * - detects dvb card automatically
 * - no need for initial tuning data, but therefore up to now no DVB-S support
 * - some adaptions for VDR syntax
 *
 * have phun, wirbel 2006/02/16
 ##############################################################################
 */

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/ioctl.h>
#include <sys/poll.h>
#include <unistd.h>
#include <fcntl.h>
#include <time.h>
#include <errno.h>
#include <signal.h>
#include <assert.h>

//#include <linux/dvb/frontend.h>
//#include <linux/videodev.h>
#include <linux/dvb/dmx.h>


#include "list.h"
#include "dump-vdr.h"
#include "dump-xine.h"
#include "dump-dvbscan.h"
#include "dump-kaffeine.h"
#include "scan.h"
#include "atsc_psip_section.h"

static char demux_devname[80];

static struct dvb_frontend_info fe_info = {
	.type = -1
};

uint version = 20081106;
int verbosity = 2;

#define ATSC_VSB	0x01
#define ATSC_QAM	0x02
#define IS_ATSC_VSB(t)	t & ATSC_VSB
#define IS_ATSC_QAM(t)	t & ATSC_QAM

static int long_timeout;
static int tuning_speed = 1;
static int current_tp_only=1;
static int get_other_nits = 0;
static int add_frequencies = 0;
static int vdr_dump_provider;
static int vdr_dump_channum;
static int ATSC_type=ATSC_VSB;
static int no_ATSC_PSIP;
static int ca_select = 1;
static int serv_select = 3;	// 20080106: radio and tv as default (no service/other).
static int vdr_version = 4;
static int qam_no_auto = 0;	// 20060705

static enum fe_spectral_inversion caps_inversion	= INVERSION_AUTO;
static enum fe_code_rate caps_fec 			= FEC_AUTO;
static enum fe_modulation caps_qam			= QAM_AUTO;
static enum fe_modulation this_qam			= QAM_64;
static enum fe_modulation this_atsc			= VSB_8;
static enum fe_transmit_mode caps_transmission_mode 	= TRANSMISSION_MODE_AUTO;
static enum fe_guard_interval caps_guard_interval	= GUARD_INTERVAL_AUTO;
static enum fe_hierarchy caps_hierarchy			= HIERARCHY_AUTO;


enum table_type {
	PAT,
	PMT,
	SDT,
	NIT
};

enum format {
        OUTPUT_VDR,
	OUTPUT_PIDS,
	OUTPUT_XINE,
	OUTPUT_DVBSCAN_TUNING_DATA,
	OUTPUT_KAFFEINE
};
static enum format output_format = OUTPUT_VDR;



enum running_mode {
	RM_NOT_RUNNING = 0x01,
	RM_STARTS_SOON = 0x02,
	RM_PAUSING     = 0x03,
	RM_RUNNING     = 0x04
};

#define AUDIO_CHAN_MAX (32)
#define CA_SYSTEM_ID_MAX (16)

struct service {
	struct list_head list;
	int transport_stream_id;
	int service_id;
	char *provider_name;
	char *service_name;
	uint16_t pmt_pid;
	uint16_t pcr_pid;
	uint16_t video_pid;
	uint16_t audio_pid[AUDIO_CHAN_MAX];
	char audio_lang[AUDIO_CHAN_MAX][4];
	int audio_num;
	uint16_t ca_id[CA_SYSTEM_ID_MAX];
	int ca_num;
	uint16_t teletext_pid;
	uint16_t subtitling_pid;
	uint16_t ac3_pid;
	unsigned int type         : 8;
	unsigned int scrambled	  : 1;
	enum running_mode running;
	void *priv;
	int channel_num;
};

struct transponder {
	struct list_head list;
	struct list_head services;
	int network_id;
	int original_network_id;                /* onid patch by Hartmut Birr */
	int transport_stream_id;
	enum fe_type type;
	struct dvb_frontend_parameters param;
	unsigned int scan_done		  : 1;
	unsigned int last_tuning_failed	  : 1;
	unsigned int other_frequency_flag : 1;	/* DVB-T */
	int n_other_f;
	uint32_t *other_f;			/* DVB-T frequency-list descriptor */
};


struct section_buf {
	struct list_head list;
	const char *dmx_devname;
	unsigned int run_once  : 1;
	unsigned int segmented : 1;	/* segmented by table_id_ext */
	int fd;
	int pid;
	int table_id;
	int table_id_ext;
	int section_version_number;
	uint8_t section_done[32];
	int sectionfilter_done;
	unsigned char buf[1024];
	time_t timeout;
	time_t start_time;
	time_t running_time;
	struct section_buf *next_seg;	/* this is used to handle segmented tables (like NIT-other) */
};

static LIST_HEAD(scanned_transponders);
static LIST_HEAD(new_transponders);
static struct transponder *current_tp;


static void dump_dvb_parameters (FILE *f, struct transponder *p);

static void setup_filter (struct section_buf* s, const char *dmx_devname,
			  int pid, int tid, int tid_ext,
			  int run_once, int segmented, int timeout);
static void add_filter (struct section_buf *s);


/* According to the DVB standards, the combination of network_id and
 * transport_stream_id should be unique, but in real life the satellite
 * operators and broadcasters don't care enough to coordinate
 * the numbering. Thus we identify TPs by frequency (scan handles only
 * one satellite at a time). Further complication: Different NITs on
 * one satellite sometimes list the same TP with slightly different
 * frequencies, so we have to search within some bandwidth.
 */
static struct transponder *alloc_transponder(uint32_t frequency)
{
	struct transponder *tp = calloc(1, sizeof(*tp));

	tp->param.frequency = frequency;
	INIT_LIST_HEAD(&tp->list);
	INIT_LIST_HEAD(&tp->services);
	list_add_tail(&tp->list, &new_transponders);
	return tp;
}

static int is_same_transponder(uint32_t f1, uint32_t f2)
{
	uint32_t diff;
	if (f1 == f2)
		return 1;
	diff = (f1 > f2) ? (f1 - f2) : (f2 - f1);
	//FIXME: use symbolrate etc. to estimate bandwidth
	if (diff < 2000) {
		debug("f1 = %u is same TP as f2 = %u\n", f1, f2);
		return 1;
	}
	return 0;
}

static struct transponder *find_transponder(uint32_t frequency)
{
	struct list_head *pos;
	struct transponder *tp;

	list_for_each(pos, &scanned_transponders) {
		tp = list_entry(pos, struct transponder, list);
		if (is_same_transponder(tp->param.frequency, frequency))
			return tp;
	}
	list_for_each(pos, &new_transponders) {
		tp = list_entry(pos, struct transponder, list);
		if (is_same_transponder(tp->param.frequency, frequency))
			return tp;
	}
	return NULL;
}

static void copy_transponder(struct transponder *d, struct transponder *s)
{
	d->network_id = s->network_id;
	d->original_network_id = s->original_network_id;  /* onid patch by Hartmut Birr */
	d->transport_stream_id = s->transport_stream_id;
	d->type = s->type;
	memcpy(&d->param, &s->param, sizeof(d->param));
	d->scan_done = s->scan_done;
	d->last_tuning_failed = s->last_tuning_failed;
	d->other_frequency_flag = s->other_frequency_flag;
	d->n_other_f = s->n_other_f;
	if (d->n_other_f) {
		d->other_f = calloc(d->n_other_f, sizeof(uint32_t));
		memcpy(d->other_f, s->other_f, d->n_other_f * sizeof(uint32_t));
	} 

	else
		d->other_f = NULL;
}

/* service_ids are guaranteed to be unique within one TP
 * (the DVB standards say theay should be unique within one
 * network, but in real life...)
 */
static struct service *alloc_service(struct transponder *tp, int service_id)
{
	struct service *s = calloc(1, sizeof(*s));
	INIT_LIST_HEAD(&s->list);
	s->service_id = service_id;
	list_add_tail(&s->list, &tp->services);
	return s;
}

static struct service *find_service(struct transponder *tp, int service_id)
{
	struct list_head *pos;
	struct service *s;

	list_for_each(pos, &tp->services) {
		s = list_entry(pos, struct service, list);
		if (s->service_id == service_id)
			return s;
	}
	return NULL;
}


static void parse_ca_identifier_descriptor (const unsigned char *buf,
				     struct service *s) {
  unsigned char len = buf [1];
  int i;

  buf += 2;

  if (len > sizeof(s->ca_id)) {
    len = sizeof(s->ca_id);
    warning("too many CA system ids\n");
    }
  memcpy(s->ca_id, buf, len);
  s->ca_num=0;
  for (i = 0; i < len / sizeof(s->ca_id[0]); i++) {
    int id = ((s->ca_id[i] & 0x00FF) << 8) + ((s->ca_id[i] & 0xFF00) >> 8);
    s->ca_id[i] = id;
    moreverbose("  CA ID     : PID 0x%04x\n", s->ca_id[i]);
    s->ca_num++;
    }
}

static void parse_ca_descriptor (const unsigned char *buf, struct service *s) {
 unsigned char descriptor_length = buf [1];
 int CA_system_ID;
 // int CA_PID;		// not needed for VDR
 int found=0;
 int i;

 buf += 2;

 if (descriptor_length < 4) return;
 CA_system_ID = (buf[0] << 8) | buf[1];

 for (i=0; i<s->ca_num; i++)
   if (s->ca_id[i] == CA_system_ID)
     found++;

 if (!found) {
   if (s->ca_num + 1 >= CA_SYSTEM_ID_MAX)
     warning("TOO MANY CA SYSTEM IDs.\n");
   else {
      moreverbose("  CA ID     : PID 0x%04x\n", CA_system_ID);
      s->ca_id[s->ca_num]=CA_system_ID;
      s->ca_num++;
      }
    } 	
} 


static void parse_iso639_language_descriptor (const unsigned char *buf, struct service *s)
{
	unsigned char len = buf [1];

	buf += 2;

	if (len >= 4) {
		debug("    LANG=%.3s %d\n", buf, buf[3]);
		memcpy(s->audio_lang[s->audio_num], buf, 3);
#if 0
		/* seems like the audio_type is wrong all over the place */
		//if (buf[3] == 0) -> normal
		if (buf[3] == 1)
			s->audio_lang[s->audio_num][3] = '!'; /* clean effects (no language) */
		else if (buf[3] == 2)
			s->audio_lang[s->audio_num][3] = '?'; /* for the hearing impaired */
		else if (buf[3] == 3)
			s->audio_lang[s->audio_num][3] = '+'; /* visually impaired commentary */
#endif
	}
}

static void parse_network_name_descriptor (const unsigned char *buf, void *dummy)
{
	unsigned char len = buf [1];

	info("Network Name '%.*s'\n", len, buf + 2);
}

static void parse_terrestrial_uk_channel_number (const unsigned char *buf, void *dummy)
{
	int i, n, channel_num, service_id;
	struct list_head *p1, *p2;
	struct transponder *t;
	struct service *s;

	// 32 bits per record
	n = buf[1] / 4;
	if (n < 1)
		return;

	// desc id, desc len, (service id, service number)
	buf += 2;
	for (i = 0; i < n; i++) {
		service_id = (buf[0]<<8)|(buf[1]&0xff);
		channel_num = (buf[2]&0x03<<8)|(buf[3]&0xff);
		debug("Service ID 0x%x has channel number %d ", service_id, channel_num);
		list_for_each(p1, &scanned_transponders) {
			t = list_entry(p1, struct transponder, list);
			list_for_each(p2, &t->services) {
				s = list_entry(p2, struct service, list);
				if (s->service_id == service_id)
					s->channel_num = channel_num;
			}
		}
		buf += 4;
	}
}


static long bcd32_to_cpu (const int b0, const int b1, const int b2, const int b3)
{
	return ((b0 >> 4) & 0x0f) * 10000000 + (b0 & 0x0f) * 1000000 +
	       ((b1 >> 4) & 0x0f) * 100000   + (b1 & 0x0f) * 10000 +
	       ((b2 >> 4) & 0x0f) * 1000     + (b2 & 0x0f) * 100 +
	       ((b3 >> 4) & 0x0f) * 10       + (b3 & 0x0f);
}


static const fe_code_rate_t fec_tab [8] = {
	FEC_AUTO, FEC_1_2, FEC_2_3, FEC_3_4,
	FEC_5_6, FEC_7_8, FEC_NONE, FEC_NONE
};


static const fe_modulation_t qam_tab [7] = {
	QAM_AUTO, QAM_16, QAM_32, QAM_64, QAM_128, QAM_256
};


static void parse_cable_delivery_system_descriptor (const unsigned char *buf,
					     struct transponder *t)
{
	if (!t) {
		warning("cable_delivery_system_descriptor outside transport stream definition (ignored)\n");
		return;
	}
	t->type = FE_QAM;

	t->param.frequency = bcd32_to_cpu (buf[2], buf[3], buf[4], buf[5]);
	t->param.frequency *= 100;
	t->param.u.qam.fec_inner = fec_tab[buf[12] & 0x07];
	t->param.u.qam.symbol_rate = 10 * bcd32_to_cpu (buf[9],
							buf[10],
							buf[11],
							buf[12] & 0xf0);
	if ((buf[8] & 0x0f) > 5)
		t->param.u.qam.modulation = QAM_AUTO;
	else
		t->param.u.qam.modulation = qam_tab[buf[8] & 0x0f];
	t->param.inversion = caps_inversion;

	if (verbosity >= 5) {
		debug("0x%#04x/0x%#04x ", t->network_id, t->transport_stream_id);
		dump_dvb_parameters (stderr, t);
		if (t->scan_done)
			dprintf(5, " (done)");
		if (t->last_tuning_failed)
			dprintf(5, " (no signal)");
		dprintf(5, "\n");
	}
}


static void parse_terrestrial_delivery_system_descriptor (const unsigned char *buf,
						   struct transponder *t)
{
	static const fe_modulation_t m_tab [] = { QPSK, QAM_16, QAM_64, QAM_AUTO };
	static const fe_code_rate_t ofec_tab [8] = { FEC_1_2, FEC_2_3, FEC_3_4,
					       FEC_5_6, FEC_7_8 };
	struct dvb_ofdm_parameters *o;

	if (!t) {
		warning("terrestrial_delivery_system_descriptor outside transport stream definition (ignored)\n");
		return;
	}
	o = &t->param.u.ofdm;
	t->type = FE_OFDM;

	t->param.frequency = (buf[2] << 24) | (buf[3] << 16);
	t->param.frequency |= (buf[4] << 8) | buf[5];
	t->param.frequency *= 10;
	t->param.inversion = caps_inversion;

	o->bandwidth = BANDWIDTH_8_MHZ + ((buf[6] >> 5) & 0x3);
	o->constellation = m_tab[(buf[7] >> 6) & 0x3];
	o->hierarchy_information = HIERARCHY_NONE + ((buf[7] >> 3) & 0x3);

	if ((buf[7] & 0x7) > 4)
		o->code_rate_HP = FEC_AUTO;
	else
		o->code_rate_HP = ofec_tab [buf[7] & 0x7];

	if (((buf[8] >> 5) & 0x7) > 4)
		o->code_rate_LP = FEC_AUTO;
	else
		o->code_rate_LP = ofec_tab [(buf[8] >> 5) & 0x7];

	o->guard_interval = GUARD_INTERVAL_1_32 + ((buf[8] >> 3) & 0x3);

	o->transmission_mode = (buf[8] & 0x2) ?
			       TRANSMISSION_MODE_8K :
			       TRANSMISSION_MODE_2K;

	t->other_frequency_flag = (buf[8] & 0x01);

	if (verbosity >= 5) {
		debug("0x%#04x/0x%#04x ", t->network_id, t->transport_stream_id);
		dump_dvb_parameters (stderr, t);
		if (t->scan_done)
			dprintf(5, " (done)");
		if (t->last_tuning_failed)
			dprintf(5, " (no signal)");
		dprintf(5, "\n");
	}
}

static void parse_frequency_list_descriptor (const unsigned char *buf,
				      struct transponder *t)
{
	int n, i;
	typeof(*t->other_f) f;

	if (!t) {
		warning("frequency_list_descriptor outside transport stream definition (ignored)\n");
		return;
	}
	if (t->other_f)
		return;

	n = (buf[1] - 1) / 4;
	if (n < 1 || (buf[2] & 0x03) != 3)
		return;

	t->other_f = calloc(n, sizeof(*t->other_f));
	t->n_other_f = n;
	buf += 3;
	for (i = 0; i < n; i++) {
		f = (buf[0] << 24) | (buf[1] << 16) | (buf[2] << 8) | buf[3];
		t->other_f[i] = f * 10;
		buf += 4;
	}
}

static void parse_service_descriptor (const unsigned char *buf, struct service *s)
{
	unsigned char len;
	unsigned char *src, *dest;

	s->type = buf[2];

	buf += 3;
	len = *buf;
	buf++;

	if (s->provider_name)
		free (s->provider_name);

	s->provider_name = malloc (len + 1);
	memcpy (s->provider_name, buf, len);
	s->provider_name[len] = '\0';

	/* remove control characters (FIXME: handle short/long name) */
	/* FIXME: handle character set correctly (e.g. via iconv)
	 * c.f. EN 300 468 annex A */
	for (src = dest = (unsigned char *) s->provider_name; *src; src++)
		if (*src >= 0x20 && (*src < 0x80 || *src > 0x9f))
			*dest++ = *src;
	*dest = '\0';
	if (!s->provider_name[0]) {
		/* zap zero length names */
		free (s->provider_name);
		s->provider_name = 0;
	}

	if (s->service_name)
		free (s->service_name);

	buf += len;
	len = *buf;
	buf++;

	s->service_name = malloc (len + 1);
	memcpy (s->service_name, buf, len);
	s->service_name[len] = '\0';

	/* remove control characters (FIXME: handle short/long name) */
	/* FIXME: handle character set correctly (e.g. via iconv)
	 * c.f. EN 300 468 annex A */
	for (src = dest = (unsigned char *) s->service_name; *src; src++)
		if (*src >= 0x20 && (*src < 0x80 || *src > 0x9f))
			*dest++ = *src;
	*dest = '\0';
	if (!s->service_name[0]) {
		/* zap zero length names */
		free (s->service_name);
		s->service_name = 0;
	}

	info("     %s(%s)\n",
	    s->service_name, s->provider_name);
}

static int find_descriptor(uint8_t tag, const unsigned char *buf,
		int descriptors_loop_len,
		const unsigned char **desc, int *desc_len)
{
	while (descriptors_loop_len > 0) {
		unsigned char descriptor_tag = buf[0];
		unsigned char descriptor_len = buf[1] + 2;

		if (!descriptor_len) {
			warning("descriptor_tag == 0x%02x, len is 0\n", descriptor_tag);
			break;
		}

		if (tag == descriptor_tag) {
			if (desc)
				*desc = buf;
			if (desc_len)
				*desc_len = descriptor_len;
			return 1;
		}

		buf += descriptor_len;
		descriptors_loop_len -= descriptor_len;
	}
	return 0;
}

static void parse_descriptors(enum table_type t, const unsigned char *buf,
			      int descriptors_loop_len, void *data)
{
	while (descriptors_loop_len > 0) {
		unsigned char descriptor_tag = buf[0];
		unsigned char descriptor_len = buf[1] + 2;

		if (!descriptor_len) {
			warning("descriptor_tag == 0x%02x, len is 0\n", descriptor_tag);
			break;
		}

		switch (descriptor_tag) {
		case 0x00:	break;		/* 0x00 MHP application_descriptor */
		case 0x01:	break;		/* 0x01 MHP application_name_desriptor */
		case 0x02:	break;		/* 0x02 MHP transport_protocol_descriptor */
		case 0x03:	break;		/* 0x03 dvb_j_application_descriptor() */
		case 0x04:	break;		/* 0x04 dvb_j_application_location_descriptor */
		case 0x09:			/* 0x09 ca_descriptor, 20080106 */
			if (t == PMT)
				parse_ca_descriptor (buf, data);	
			break;	
		case 0x0A:			/* 0x0A iso_639_language_descriptor */
			if (t == PMT)
				parse_iso639_language_descriptor (buf, data);
			break;
		case 0x0B:	break;		/* 0x0B application_icons_descriptor */
		case 0x13:	break;		/* 0x13 carousel_identifier_descriptor, to do */
		case 0x40:			/* 0x40 network_name_descriptor */
			if (t == NIT)
				parse_network_name_descriptor (buf, data);
			break;
		case 0x41:	break;		/* 0x41 service_list_descriptor */
		case 0x42:	break;		/* 0x42 stuffing_descriptor */
		case 0x43:	break;		/* 0x43 satellite_delivery_system_descriptor */
		case 0x44:			/* 0x44 cable_delivery_system_descriptor */
			if (t == NIT)
				parse_cable_delivery_system_descriptor (buf, data);
			break;
		case 0x45:			/* 0x45 vbi_data_descriptor */
		case 0x46:			/* 0x46 vbi_teletext_descriptor */
		case 0x47:			/* 0x47 bouquet_name_descriptor */
		case 0x48:			/* 0x48 service_descriptor */
			if (t == SDT)
				parse_service_descriptor (buf, data);
			break;
		case 0x49:	break;		/* 0x49 country_availability_descriptor */
		case 0x4A:	break;		/* 0x4A linkage_descriptor */
		case 0x4B:	break;		/* 0x4B nvod_reference_descriptor */
		case 0x4C:	break;		/* 0x4C time_shifted_service_descriptor */
		case 0x4D:	break;		/* 0x4D short_event_descriptor */
		case 0x4E:	break;		/* 0x4E extended_event_descriptor */
		case 0x4F:	break;		/* 0x4F time_shifted_event_descriptor */
		case 0x50:	break;		/* 0x50 component_descriptor */
		case 0x51:	break;		/* 0x51 mosaic_descriptor */
		case 0x52:	break;		/* 0x52 stream_identifier_descriptor */
		case 0x53:			/* 0x53 ca_identifier_descriptor */
			if (t == SDT)
				parse_ca_identifier_descriptor (buf, data);
			break;
		case 0x54:	break;		/* 0x54 content_descriptor */
		case 0x55:	break;		/* 0x55 parental_rating_descriptor */
		case 0x56:	break;		/* 0x56 teletext_descriptor */
		case 0x57:	break;		/* 0x57 telephone_descriptor */
		case 0x58:	break;		/* 0x58 local_time_offset_descriptor */
		case 0x59:	break;		/* 0x59 subtitling_descriptor */
		case 0x5A:			/* 0x5A terrestrial_delivery_system_descriptor */
			if (t == NIT)
				parse_terrestrial_delivery_system_descriptor (buf, data);
			break;
		case 0x5B:	break;		/* 0x5B multilingual_network_name_descriptor */
		case 0x5C:	break;		/* 0x5C multilingual_bouquet_name_descriptor */
		case 0x5D:	break;		/* 0x5D multilingual_service_name_descriptor */
		case 0x5E:	break;		/* 0x5E multilingual_component_descriptor */
		case 0x5F:	break;		/* 0x5F private_data_specifier_descriptor */
		case 0x60:	break;		/* 0x60 service_move_descriptor */
		case 0x61:	break;		/* 0x61 short_smoothing_buffer_descriptor */
		case 0x62:			/* 0x62 frequency_list_descriptor */
			if (t == NIT)
				parse_frequency_list_descriptor (buf, data);
			break;
		case 0x63:	break;		/* 0x63 partial_transport_stream_descriptor */
		case 0x64:	break;		/* 0x64 data_broadcast_descriptor */
		case 0x65:	break;		/* 0x65 scrambling_descriptor */
		case 0x66:	break;		/* 0x66 data_broadcast_id_descriptor */
		case 0x67:	break;		/* 0x67 transport_stream_descriptor */
		case 0x68:	break;		/* 0x68 dsng_descriptor */
		case 0x69:	break;		/* 0x69 pdc_descriptor */
		case 0x6A:	break;		/* 0x6A ac3_descriptor */
		case 0x6B:	break;		/* 0x6B ancillary_data_descriptor */
		case 0x6C:	break;		/* 0x6C cell_list_descriptor */
		case 0x6D:	break;		/* 0x6D cell_frequency_link_descriptor */
		case 0x6E:	break;		/* 0x6E announcement_support_descriptor */
		case 0x6F:	break;		/* 0x6F application_signalling_descriptor */
		case 0x71:	break;		/* 0x71 service_identifier_descriptor (ETSI TS 102 812, MHP) */
		case 0x72:	break;		/* 0x72 service_availbility_descriptor */
		case 0x73:	break;		/* 0x73 default_authority_descriptor (ETSI TS 102 323) */
		case 0x74:	break;		/* 0x74 related_content_descriptor (ETSI TS 102 323) */
		case 0x75:	break;		/* 0x75 tva_id_descriptor (ETSI TS 102 323) */
		case 0x76:	break;		/* 0x76 content_identifier_descriptor (ETSI TS 102 323) */
		case 0x77:	break;		/* 0x77 time_slice_fec_identifier_descriptor (ETSI EN 301 192) */
		case 0x78:	break;		/* 0x78 ecm_repetition_rate_descriptor (ETSI EN 301 192) */
		case 0x79:	break;		/* 0x79 s2_satellite_delivery_system_descriptor */
		case 0x7A:	break;		/* 0x7A enhanced_ac3_descriptor */
		case 0x7B:	break;		/* 0x7B dts_descriptor */
		case 0x7C:	break;		/* 0x7C aac_descriptor */
		case 0x7F:	break;		/* 0x7F extension_descriptor */		
		case 0x83:
			/* 0x83 is in the privately defined range of descriptor tags,
			 * so we parse this only if the user says so to avoid
			 * problems when 0x83 is something entirely different... */
			if (t == NIT && vdr_dump_channum)
				parse_terrestrial_uk_channel_number (buf, data);
			break;
		case 0xF2:	break;		// 0xF2 Private DVB Descriptor  Premiere.de, Content Transmission Descriptor

		default:
			verbosedebug("skip descriptor 0x%02x\n", descriptor_tag);
		};

		buf += descriptor_len;
		descriptors_loop_len -= descriptor_len;
	}
}


static void parse_pat(const unsigned char *buf, int section_length,
		      int transport_stream_id)
{
	while (section_length > 0) {
		struct service *s;
		int service_id = (buf[0] << 8) | buf[1];

		if (service_id == 0) {
			verbosedebug ("skipping %02x %02x %02x %02x (service_id == 0)\n", buf[0],buf[1],buf[2],buf[3]);
			buf += 4;		/*  skip nit pid entry... */
			section_length -= 4;
			continue;
		}
		/* SDT might have been parsed first... */
		s = find_service(current_tp, service_id);
		if (!s)
			s = alloc_service(current_tp, service_id);
		s->pmt_pid = ((buf[2] & 0x1f) << 8) | buf[3];
		if (!s->priv && s->pmt_pid) {
			s->priv = malloc(sizeof(struct section_buf));
			setup_filter(s->priv, demux_devname,
